tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'buo/cask-upgrade'

# dev
brew 'cmake'
brew 'mysql'
brew 'nvm'
brew 'yarn'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pipenv'
brew 'direnv'
brew 'rbenv'
brew 'vim'

# tools
brew 'wget'
brew 'mas'
brew 'htop'
brew 'ssh-copy-id'
brew 'youtube-dl'
brew 'bat'
brew 'thefuck'
brew 'beets'
brew 'imagemagick'
brew 'wget'
brew ''
brew 'pkg-config'

# productivity
brew 'exa'
brew 'ripgrep'
brew 'fd'
brew 'vim'

# [fonts] for code editor
cask 'font-menlo-for-powerline'
# [fonts] for web rendering
cask 'font-fira-code'

# [cask] dev
# cask 'visual-studio-code'
cask 'iterm2'
cask 'atom'
cask 'sequel-pro'
cask 'gpg-suite'

# [cask] productivity
cask 'hiddenbar'
cask 'appcleaner'
cask 'iina'
cask 'suspicious-package'
cask 'keka'
cask 'ripcord'
cask 'rocket'
cask 'textual'
cask 'typora'
cask 'zoom'

# App Store apps
mas 'Things', id: 904280696
mas 'Tampermonkey', id: 1482490089
mas 'Reeder', id: 1529448980
mas 'Transmit', id: 1436522307
mas 'Craft', id: 1487937127
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Step Two', id: 1448916662
mas 'Magnet', id: 441258766
mas 'Pins', id: 1547106997
